[
  {
    "id": "about-sistc-main",
    "title": "About SISTC - Overview",
    "category": "about",
    "text": "Sydney International School of Technology and Commerce (SISTC) is an Australian higher education provider established in 2020. SISTC is dedicated to providing innovative, industry-focused IT education that prepares students for successful careers in the digital economy. We are committed to excellence in teaching, student support, and creating pathways to employment in the technology sector."
  },
  {
    "id": "about-accreditation",
    "title": "SISTC Accreditation and Registration",
    "category": "about",
    "text": "SISTC is fully accredited and registered with Australian regulatory bodies. TEQSA Provider ID: PRV14311. CRICOS Provider Code: 03836J. ABN: 74 613 055 440. Our courses are accredited by the Australian Computer Society (ACS), ensuring graduates meet industry standards and are recognized by employers across Australia and internationally."
  },
  {
    "id": "about-mission-vision",
    "title": "SISTC Mission and Vision",
    "category": "about",
    "text": "Our Mission: To provide innovative IT education that prepares students for successful careers in the information economy. Our Vision: To be a leading provider of quality IT education, recognized for our industry partnerships, student outcomes, and contribution to the digital workforce. We focus on practical skills, industry connections, and preparing students for the digital future."
  },
  {
    "id": "about-why-sistc",
    "title": "Why Choose SISTC",
    "category": "about",
    "text": "Why study at SISTC? ACS Accredited courses ensuring industry recognition. Small class sizes for personalized attention. Industry-experienced lecturers. Work Integrated Learning opportunities. Modern campus facilities in prime locations. Comprehensive student support services. Pathways to employment through industry connections. Flexible study options with trimester system."
  },
  {
    "id": "course-bit-overview",
    "title": "Bachelor of Information Technology - Overview",
    "category": "courses",
    "text": "The Bachelor of Information Technology (BIT) is a 3-year full-time undergraduate degree designed to provide students with comprehensive knowledge and practical skills in information technology. The program is ACS (Australian Computer Society) accredited, ensuring graduates meet industry standards. Students can choose from two majors: Business Information Systems or Digital Enterprise. Course Code: BIT. Duration: 3 years full-time (6 trimesters). Credit Points: 240 credit points (24 units at 10 credit points each)."
  },
  {
    "id": "course-bit-majors",
    "title": "Bachelor of IT - Available Majors",
    "category": "courses",
    "text": "The Bachelor of Information Technology offers two specialization majors: 1) Business Information Systems Major - focuses on the intersection of business and technology, teaching students to analyze business processes, design information systems, and implement technology solutions. Career paths include Business Analyst, Systems Analyst, IT Consultant. 2) Digital Enterprise Major - prepares students for the digital economy with topics including digital business models, e-commerce, cloud computing, and enterprise systems. Career paths include Digital Transformation Specialist, Enterprise Systems Analyst."
  },
  {
    "id": "course-bit-structure",
    "title": "Bachelor of IT - Course Structure",
    "category": "courses",
    "text": "Bachelor of Information Technology Course Structure: Year 1 - Foundation units covering programming fundamentals, database concepts, systems analysis, and professional skills. Students completing Year 1 may exit with Diploma of Information Technology. Year 2 - Advanced units in networking, web development, project management, and chosen major subjects. Year 3 - Specialization units, capstone project, and Work Integrated Learning. Total: 24 units across 6 trimesters."
  },
  {
    "id": "course-bit-core-units",
    "title": "Bachelor of IT - Core Units",
    "category": "courses",
    "text": "Bachelor of IT Core Units include: Programming Fundamentals, Database Design and Development, Systems Analysis and Design, Computer Networks, Web Technologies, IT Project Management, Professional Practice in IT, Information Security Fundamentals, Data Structures and Algorithms, Software Engineering, Cloud Computing Fundamentals, Business Intelligence and Analytics."
  },
  {
    "id": "course-bit-entry",
    "title": "Bachelor of IT - Entry Requirements",
    "category": "courses",
    "text": "Bachelor of Information Technology Entry Requirements: Academic: Completion of Australian Year 12 or equivalent international qualification with satisfactory academic performance. English Language: IELTS 6.0 overall with no band less than 5.5, or equivalent (TOEFL iBT 60, PTE Academic 50). Mature Age Entry: Applicants 21+ without formal qualifications may be considered based on work experience. Pathway: Completion of a relevant Diploma or Certificate IV may provide entry with advanced standing."
  },
  {
    "id": "course-mit-overview",
    "title": "Master of Information Technology - Overview",
    "category": "courses",
    "text": "The Master of Information Technology (MIT) is a 2-year full-time postgraduate degree designed for career advancement in the IT industry. The program is ACS (Australian Computer Society) accredited. Students can specialize in one of three areas: Data Analytics, Digital Leadership, or Cyber Security. Course Code: MIT. Duration: 2 years full-time (4 trimesters). Credit Points: 160 credit points (16 units at 10 credit points each). No IT background required - the program accepts graduates from any discipline."
  },
  {
    "id": "course-mit-specialisations",
    "title": "Master of IT - Specialisations",
    "category": "courses",
    "text": "Master of Information Technology Specialisations: 1) Data Analytics - Learn data mining, statistical analysis, machine learning, data visualization, and big data technologies. Careers: Data Analyst, Data Scientist, Business Intelligence Developer. 2) Digital Leadership - IT strategy, project management, change management, digital innovation, technology governance. Careers: IT Manager, CTO, Digital Transformation Lead. 3) Cyber Security - Network security, ethical hacking, security governance, risk management, incident response. Careers: Security Analyst, Penetration Tester, Security Consultant."
  },
  {
    "id": "course-mit-structure",
    "title": "Master of IT - Course Structure",
    "category": "courses",
    "text": "Master of Information Technology Course Structure: Semester 1-2: Core units covering advanced IT concepts, research methods, and foundation subjects. Students completing 4 units may exit with Graduate Certificate in IT. Semester 3: Specialisation units in chosen area. Students completing 8 units may exit with Graduate Diploma in IT. Semester 4: Advanced specialisation units, industry project or research project. Total: 16 units across 4 trimesters."
  },
  {
    "id": "course-mit-entry",
    "title": "Master of IT - Entry Requirements",
    "category": "courses",
    "text": "Master of Information Technology Entry Requirements: Academic: Bachelor's degree in any discipline from a recognized institution (IT background NOT required). English Language: IELTS 6.5 overall with no band less than 6.0, or equivalent (TOEFL iBT 79, PTE Academic 58). Work Experience: While not mandatory, relevant work experience is valued. Pathway: Graduate Certificate or Graduate Diploma in IT may provide entry for those without a bachelor's degree."
  },
  {
    "id": "course-diploma-bit",
    "title": "Diploma of Business Information Systems",
    "category": "courses",
    "text": "Diploma of Business Information Systems is an exit-only qualification from the Bachelor of Information Technology. Students who complete the first year (8 units) of the BIT program with the Business Information Systems major can exit with this diploma. The qualification provides foundational knowledge in IT and business systems, suitable for entry-level positions in IT support, junior analyst roles, or as a pathway to further study."
  },
  {
    "id": "course-diploma-it",
    "title": "Diploma of Information Technology",
    "category": "courses",
    "text": "Diploma of Information Technology is an exit-only qualification from the Bachelor of Information Technology. Students who complete the first year (8 units) of the BIT program with the Digital Enterprise major can exit with this diploma. The qualification covers fundamental IT skills including programming, databases, and networking, suitable for entry-level IT positions or as a pathway to further study."
  },
  {
    "id": "course-grad-cert",
    "title": "Graduate Certificate in Information Technology",
    "category": "courses",
    "text": "Graduate Certificate in Information Technology is an exit-only qualification from the Master of IT program. Students completing 4 units (40 credit points) can exit with this certificate. Duration: 1 trimester full-time. The Graduate Certificate provides foundational postgraduate IT knowledge and can be used as a pathway to the full Master's degree for students who need to build their skills before committing to the full program."
  },
  {
    "id": "course-grad-dip",
    "title": "Graduate Diploma in Information Technology",
    "category": "courses",
    "text": "Graduate Diploma in Information Technology is an exit-only qualification from the Master of IT program. Students completing 8 units (80 credit points) can exit with this diploma. Duration: 2 trimesters full-time. The Graduate Diploma provides substantial postgraduate IT knowledge suitable for career advancement without completing the full Master's program."
  },
  {
    "id": "location-sydney-cbd",
    "title": "Sydney CBD Campus",
    "category": "locations",
    "text": "SISTC Sydney CBD Campus is located in the heart of Sydney's Central Business District. The campus features modern classrooms, computer labs with latest hardware and software, collaborative learning spaces, and student common areas. Located near public transport (trains, buses, light rail), surrounded by cafes, restaurants, and shopping. Address: Sydney CBD, New South Wales. The vibrant CBD location provides students with access to industry networking opportunities and employment prospects."
  },
  {
    "id": "location-sydney-highlights",
    "title": "Sydney CBD Campus - Highlights",
    "category": "locations",
    "text": "Sydney CBD Campus Highlights: Central location in Australia's largest city. Walking distance to Sydney Harbour and Opera House. World-class shopping at Pitt Street Mall and QVB. Diverse dining options from casual to fine dining. Easy access via Central Station, Town Hall Station, and Wynyard Station. Close to major tech companies and startups. Vibrant nightlife and cultural attractions. Beautiful parks including Hyde Park and Royal Botanic Gardens."
  },
  {
    "id": "location-parramatta",
    "title": "Parramatta Campus",
    "category": "locations",
    "text": "SISTC Parramatta Campus is located in the heart of Greater Western Sydney, Australia's fastest-growing economic region. The campus offers modern facilities, computer labs, and collaborative spaces. Excellent public transport connections via Parramatta Station and bus routes. Address: Parramatta, Greater Western Sydney, New South Wales. The Parramatta location provides access to growing tech industry opportunities in Western Sydney."
  },
  {
    "id": "location-parramatta-highlights",
    "title": "Parramatta Campus - Highlights",
    "category": "locations",
    "text": "Parramatta Campus Highlights: Heart of Western Sydney's economic hub. Westfield Parramatta for shopping and entertainment. Church Street dining precinct with global cuisines. Historic Parramatta Park and Old Government House. Excellent transport links to Sydney CBD (30 mins by train). Growing tech and business district. Affordable living compared to Sydney CBD. Diverse multicultural community."
  },
  {
    "id": "location-melbourne",
    "title": "Melbourne Campus",
    "category": "locations",
    "text": "SISTC Melbourne Campus is located in Melbourne's CBD, Victoria's capital and Australia's second-largest city. The campus features modern teaching facilities, computer labs, and student spaces. Excellent public transport via trams, trains, and buses. Address: Melbourne CBD, Victoria. Melbourne is known for its vibrant culture, arts scene, and strong tech industry presence."
  },
  {
    "id": "location-melbourne-highlights",
    "title": "Melbourne Campus - Highlights",
    "category": "locations",
    "text": "Melbourne Campus Highlights: Australia's cultural capital. Famous laneway cafes and coffee culture. Collins Street and Bourke Street shopping. World-class arts, music, and sporting events. Free tram zone in CBD. Federation Square and Southbank. Strong tech startup ecosystem. Ranked among world's most liveable cities. Diverse food scene with restaurants from every cuisine."
  },
  {
    "id": "fees-overview",
    "title": "Tuition Fees Overview",
    "category": "fees",
    "text": "SISTC offers competitive tuition fees for all programs. Fees are charged per unit/subject and vary by program level. Bachelor of Information Technology: Fees apply per trimester based on enrolled units. Master of Information Technology: Fees apply per trimester based on enrolled units. Additional costs may include: Student Services and Amenities Fee (SSAF), textbooks and materials, Overseas Student Health Cover (OSHC) for international students. Contact admissions for current fee schedules: Phone +61 (2) 9061 5900 or visit sistc.edu.au."
  },
  {
    "id": "fees-domestic",
    "title": "Domestic Student Fees and FEE-HELP",
    "category": "fees",
    "text": "Domestic Student Fees: Australian citizens and permanent residents may be eligible for FEE-HELP, a government loan scheme. FEE-HELP allows eligible students to defer tuition fees until earning above the repayment threshold. No upfront payment required if using FEE-HELP. Repayments are made through the tax system once income exceeds the threshold. Commonwealth Supported Places (CSP) are not available at SISTC - all domestic students are full-fee paying. Contact Student Services for current domestic fee information."
  },
  {
    "id": "fees-international",
    "title": "International Student Fees",
    "category": "fees",
    "text": "International Student Fees: Tuition fees for international students are published on the SISTC website and in offer letters. Fees are subject to annual review. Additional costs for international students include: Overseas Student Health Cover (OSHC) - mandatory for student visa holders. Living expenses (accommodation, food, transport, personal). Study materials and textbooks. Visa application fees. Payment plans may be available - contact the finance office. Visit sistc.edu.au for current international fee schedules."
  },
  {
    "id": "fees-payment",
    "title": "Payment Options and Plans",
    "category": "fees",
    "text": "SISTC Payment Options: Full upfront payment before census date. FEE-HELP for eligible domestic students. Payment plans may be available for students facing financial hardship. Bank transfer, credit card, and BPAY accepted. Census Date: The deadline to pay fees or submit FEE-HELP application. Students who withdraw after census date remain liable for fees. Contact the Finance Office to discuss payment options: Phone +61 (2) 9061 5900."
  },
  {
    "id": "scholarships",
    "title": "Scholarships and Financial Assistance",
    "category": "fees",
    "text": "SISTC Scholarships: Various scholarship opportunities may be available based on academic merit, financial need, or specific criteria. Merit-based scholarships for high-achieving students. International student scholarships. Women in IT scholarships to support female students in technology. Contact the Admissions Office for current scholarship availability and application procedures. Email or call +61 (2) 9061 5900 to inquire about scholarships."
  },
  {
    "id": "apply-process",
    "title": "How to Apply to SISTC",
    "category": "applying",
    "text": "How to Apply to SISTC: Step 1: Choose your course (Bachelor of IT or Master of IT). Step 2: Check entry requirements for your chosen course. Step 3: Gather required documents (transcripts, English test results, passport copy). Step 4: Submit application online at sistc.edu.au or through an authorized education agent. Step 5: Receive assessment and offer letter. Step 6: Accept offer and pay deposit. Step 7: Receive Confirmation of Enrolment (CoE). Step 8: Apply for student visa (international students). Step 9: Attend orientation and commence studies."
  },
  {
    "id": "apply-documents",
    "title": "Required Application Documents",
    "category": "applying",
    "text": "Required Documents for SISTC Application: Academic transcripts from all previous studies (certified copies). Completion certificates/testamurs. English language test results (IELTS, TOEFL, PTE, or equivalent). Copy of passport (international students). Statement of Purpose (recommended for postgraduate). Resume/CV showing work experience (recommended for postgraduate). Any relevant professional certifications. Credit for Prior Learning application (if applicable). All documents must be certified copies or originals."
  },
  {
    "id": "apply-english",
    "title": "English Language Requirements",
    "category": "applying",
    "text": "SISTC English Language Requirements: Bachelor Programs: IELTS 6.0 overall (no band less than 5.5), TOEFL iBT 60, PTE Academic 50, Cambridge FCE Grade C, or equivalent. Master Programs: IELTS 6.5 overall (no band less than 6.0), TOEFL iBT 79, PTE Academic 58, Cambridge FCE Grade B, or equivalent. English pathway programs may be available for students who don't meet direct entry requirements. Native English speakers from approved countries may be exempt."
  },
  {
    "id": "apply-credit",
    "title": "Credit for Prior Learning (RPL)",
    "category": "applying",
    "text": "Credit for Prior Learning (CPL/RPL): SISTC recognizes prior learning and may grant credit for relevant qualifications or experience. This can reduce course duration and cost. To apply for credit: Submit CPL application form with your main application. Provide detailed transcripts and unit outlines from previous studies. Credit decisions are made by the Academic Board. Maximum credit varies by program. Apply for credit as early as possible - ideally with your initial application. Contact Admissions for guidance on credit eligibility."
  },
  {
    "id": "apply-agents",
    "title": "Education Agents",
    "category": "applying",
    "text": "SISTC Education Agents: SISTC works with authorized education agents worldwide to assist international students. Agents can help with: Course information and advice. Application submission and tracking. Visa guidance. Pre-departure preparation. Accommodation assistance. Find an authorized SISTC agent at sistc.meshedhe.com.au/Publics/PublicsPages/AgentListByCountry.aspx or contact SISTC directly. Only use SISTC-authorized agents to ensure correct information and support."
  },
  {
    "id": "agents-asia",
    "title": "Education Agents - Asia",
    "category": "agents",
    "text": "SISTC has authorized education agents across Asia including: India, Nepal, Bangladesh, Sri Lanka, Pakistan, China, Vietnam, Thailand, Philippines, Indonesia, Malaysia, and other Asian countries. Agents speak local languages and understand regional education systems. They can guide students through the application and visa process. Visit sistc.meshedhe.com.au/Publics/PublicsPages/AgentListByCountry.aspx for the complete agent list by country."
  },
  {
    "id": "agents-other",
    "title": "Education Agents - Other Regions",
    "category": "agents",
    "text": "SISTC has authorized education agents in regions including: Middle East (UAE, Saudi Arabia, Oman, etc.), Africa (Nigeria, Kenya, Ghana, etc.), South America (Brazil, Colombia, etc.), and other regions worldwide. If you cannot find an agent in your country, you can apply directly through sistc.edu.au or contact the International Office at +61 (2) 9061 5900."
  },
  {
    "id": "international-overview",
    "title": "International Students - Overview",
    "category": "international",
    "text": "SISTC welcomes international students from around the world. CRICOS Provider Code: 03836J allows SISTC to enroll international students on student visas. Dedicated support for international students including: Pre-arrival assistance. Airport pickup service. Orientation programs. Ongoing academic and personal support. Career services. International students bring diverse perspectives and enrich the SISTC community. Contact the International Office: +61 (2) 9061 5900."
  },
  {
    "id": "international-visa",
    "title": "Student Visa Information",
    "category": "international",
    "text": "Student Visa (Subclass 500): International students need a Student visa to study at SISTC. Requirements: Confirmation of Enrolment (CoE) from SISTC. Genuine Temporary Entrant (GTE) requirement. English language proficiency evidence. Financial capacity evidence (tuition + living expenses). Overseas Student Health Cover (OSHC). Health and character requirements. Student visa allows: Full-time study at SISTC. Work up to 48 hours per fortnight during study periods. Unlimited work during scheduled breaks. Visit homeaffairs.gov.au for visa application details."
  },
  {
    "id": "international-oshc",
    "title": "Overseas Student Health Cover (OSHC)",
    "category": "international",
    "text": "Overseas Student Health Cover (OSHC): OSHC is mandatory health insurance for international students on student visas. OSHC covers: Doctor visits. Hospital treatment. Some prescription medicines. Ambulance services. SISTC can arrange OSHC through preferred providers. OSHC must cover your entire visa period. Students with families can get OSHC Family cover. Keep your OSHC card with you at all times. Contact Student Services for OSHC assistance."
  },
  {
    "id": "international-accommodation",
    "title": "Student Accommodation",
    "category": "international",
    "text": "Accommodation Options for SISTC Students: Homestay - live with an Australian family, meals included, cultural immersion. Student Accommodation - purpose-built student housing near campuses. Private Rental - apartments or shared houses (most affordable long-term). Temporary Accommodation - hostels/hotels while finding permanent housing. SISTC Student Services can provide: Accommodation provider recommendations. Guidance on rental processes. Information about tenant rights. Average weekly costs: Homestay $250-350, Student housing $300-450, Private rental $200-400. Start searching early before arrival."
  },
  {
    "id": "international-arrival",
    "title": "Pre-Arrival and Arrival Support",
    "category": "international",
    "text": "SISTC Pre-Arrival and Arrival Support: Pre-arrival: Pre-departure information and checklists. Accommodation assistance. OSHC arrangement. On arrival: Airport pickup service (request in advance). Welcome pack with essential information. Assistance opening bank account. Getting mobile phone SIM. Obtaining Tax File Number (TFN). Public transport information (Opal card Sydney, Myki Melbourne). Orientation Week activities before classes begin. Contact International Office: +61 (2) 9061 5900."
  },
  {
    "id": "support-academic",
    "title": "Academic Support Services",
    "category": "support",
    "text": "SISTC Academic Support Services: Academic Skills Workshops - study skills, time management, exam preparation. Writing Support - essay writing, research skills, referencing. Learning Support Specialists - one-on-one assistance. Tutorial Support - additional help with course content. Academic Advisors - course planning and progression advice. Study Groups - peer learning opportunities. Academic Integrity Training - understanding plagiarism and proper citation. Special Consideration - for students facing difficult circumstances. Access support through Student Services or the Learning Management System."
  },
  {
    "id": "support-library",
    "title": "Digital Library Resources",
    "category": "support",
    "text": "SISTC Digital Library: Extensive online resources available 24/7. Access includes: Academic databases (ProQuest, EBSCO, etc.). E-books covering IT and business topics. Academic journals and research papers. Industry reports and standards. Online tutorials and learning resources. Referencing tools and guides. Library staff available for research assistance. Remote access with student login credentials. Training sessions on using library resources effectively. Contact library@sistc.edu.au for assistance."
  },
  {
    "id": "support-wellbeing",
    "title": "Health and Wellbeing Support",
    "category": "support",
    "text": "SISTC Health and Wellbeing Support: Free confidential counseling services. Mental health resources and referrals. Disability support and accessibility services. Financial hardship assistance. Emergency support services. Peer support programs. Wellness workshops (stress management, mindfulness). First aid facilities on campus. Information about external health services. Critical incident support. If you're struggling, reach out to Student Services - we're here to help. Emergency: Call 000. Lifeline: 13 11 14. Beyond Blue: 1300 22 4636."
  },
  {
    "id": "support-career",
    "title": "Career Services",
    "category": "support",
    "text": "SISTC Career Services: Resume and cover letter reviews. Interview preparation and mock interviews. Job search strategies and techniques. LinkedIn profile optimization. Industry networking events. Career counseling and planning. Graduate employment assistance. Internship and placement support. Industry guest speakers. Career workshops throughout the year. Alumni career network. Access Career Services through Student Services or attend regular career events. Building your career starts before graduation!"
  },
  {
    "id": "support-it",
    "title": "IT Facilities and Support",
    "category": "support",
    "text": "SISTC IT Facilities: Modern computer labs with latest hardware and software. High-speed WiFi across all campuses. Access to industry-standard development tools. Cloud computing resources. Specialized software for programming, databases, networking, and cyber security. Student email and Microsoft 365 access. Learning Management System (LMS) for course materials. IT Help Desk for technical support. Print and scan facilities. Labs open extended hours for student use."
  },
  {
    "id": "wil-overview",
    "title": "Work Integrated Learning (WIL)",
    "category": "programs",
    "text": "Work Integrated Learning at SISTC: WIL provides real-world experience as part of your degree. Components include: Industry Projects - work on real business problems. Professional Placements - gain workplace experience. Capstone Projects - comprehensive final-year projects with industry partners. Guest Lectures - learn from industry professionals. Site Visits - see technology in action at leading companies. WIL helps students: Build professional networks. Apply classroom learning. Develop employability skills. Enhance graduate outcomes. WIL is integrated throughout SISTC programs."
  },
  {
    "id": "capstone-projects",
    "title": "Capstone Projects Expo",
    "category": "programs",
    "text": "SISTC Capstone Projects Expo: Final-year students complete substantial capstone projects demonstrating their skills. Projects address real-world problems, often in partnership with industry. Annual Capstone Expo showcases student work to: Industry professionals and potential employers. Academic staff and external examiners. Fellow students and families. Media and public. Expo provides networking opportunities and has led to job offers for graduating students. Projects cover areas like software development, data analytics, cyber security solutions, and digital transformation initiatives."
  },
  {
    "id": "women-in-it",
    "title": "Women in IT Program",
    "category": "programs",
    "text": "SISTC Women in IT Program: Supporting female students in technology careers. Program includes: Mentorship from women in tech industry. Networking events with female IT professionals. Workshops on career development and leadership. Scholarship opportunities for female students. Community building among female IT students. Guest speakers sharing success stories. SISTC is committed to diversity and inclusion in technology. Women in IT participants gain additional support, connections, and opportunities to thrive in the tech industry."
  },
  {
    "id": "student-life",
    "title": "Student Life at SISTC",
    "category": "life",
    "text": "Student Life at SISTC: Vibrant community with students from diverse backgrounds. Activities include: Orientation Week - meet classmates and learn about SISTC. Social events throughout the year. Cultural celebrations and festivals. Student clubs and interest groups. Sports and recreation activities. Networking events with industry. Graduation ceremonies at prestigious venues. Online community through student portal. SISTC provides a supportive environment where students can learn, grow, and build lifelong connections."
  },
  {
    "id": "orientation",
    "title": "Student Orientation",
    "category": "life",
    "text": "SISTC Orientation Week: All new students attend orientation before classes begin. Activities include: Campus tour and facility introduction. Meet academic and support staff. IT account and system setup. Library and learning resources introduction. Student services overview. Course enrollment assistance. Meet your classmates and lecturers. Social activities and icebreakers. International students receive additional sessions on: Living in Australia. Opening bank accounts. Transport and getting around. Understanding Australian culture. Orientation is mandatory and sets you up for success."
  },
  {
    "id": "graduation",
    "title": "Graduation Information",
    "category": "life",
    "text": "SISTC Graduation: Graduation ceremonies celebrate student achievements. Ceremonies held at prestigious venues in Sydney and Melbourne. Multiple ceremonies per year to accommodate graduating students. Graduates receive: Testamur (degree certificate). Academic transcript. Graduates can invite family and friends to celebrate. Academic dress (cap and gown) available for hire. Professional photography available. Graduation is a memorable milestone marking your academic achievement. Keep your contact details updated to receive graduation information."
  },
  {
    "id": "trimester-system",
    "title": "Academic Calendar - Trimester System",
    "category": "academic",
    "text": "SISTC Trimester System: SISTC operates on a trimester system with three study periods per year. Trimester 1: February/March - May/June. Trimester 2: June - September. Trimester 3: September/October - January. Benefits of trimester system: Complete your degree faster (3 trimesters per year vs 2 semesters). More flexibility in course planning. Multiple entry points throughout the year. Option to take breaks between trimesters. Full-time load: 4 units per trimester. Part-time load: 1-3 units per trimester. Check sistc.edu.au for specific trimester dates."
  },
  {
    "id": "intake-dates",
    "title": "Intake Dates and Start Times",
    "category": "academic",
    "text": "SISTC Intake Dates: Multiple intakes throughout the year. Trimester 1 intake: February/March start. Trimester 2 intake: June start. Trimester 3 intake: September/October start. Application deadlines are typically 4-6 weeks before trimester start. International students should apply earlier to allow time for visa processing. Late applications may be considered subject to availability. Check sistc.edu.au for exact dates and application deadlines for each intake."
  },
  {
    "id": "study-modes",
    "title": "Study Modes and Flexibility",
    "category": "academic",
    "text": "SISTC Study Modes: Full-time: 4 units per trimester (standard load). Part-time: 1-3 units per trimester (extend course duration). International students on student visas must maintain full-time enrollment. Some units may offer flexible delivery options. Evening classes may be available for some units. Online resources supplement face-to-face learning. Contact Course Advisor to discuss best study mode for your circumstances."
  },
  {
    "id": "acs-accreditation",
    "title": "ACS Accreditation",
    "category": "accreditation",
    "text": "Australian Computer Society (ACS) Accreditation: SISTC Bachelor and Master of IT programs are ACS accredited. ACS is the professional association for Australia's ICT sector. Benefits of ACS accreditation: Industry recognition of your qualification. Pathway to ACS professional membership. Meets requirements for skilled migration assessment. Demonstrates curriculum meets industry standards. Graduates eligible to apply for ACS membership levels. ACS accreditation is reviewed regularly to ensure ongoing compliance with standards."
  },
  {
    "id": "teqsa-info",
    "title": "TEQSA Registration",
    "category": "accreditation",
    "text": "TEQSA (Tertiary Education Quality and Standards Agency): SISTC is registered with TEQSA as an Australian higher education provider. TEQSA Provider ID: PRV14311. TEQSA registration ensures: SISTC meets Australian higher education standards. Courses are nationally recognized qualifications. Students are protected under Australian consumer laws. Quality assurance and continuous improvement. TEQSA conducts regular reviews of registered providers. Students can verify SISTC's registration on the TEQSA National Register."
  },
  {
    "id": "cricos-info",
    "title": "CRICOS Registration",
    "category": "accreditation",
    "text": "CRICOS (Commonwealth Register of Institutions and Courses for Overseas Students): SISTC CRICOS Provider Code: 03836J. CRICOS registration allows SISTC to enroll international students on student visas. All courses offered to international students are CRICOS registered. CRICOS registration ensures: Compliance with the Education Services for Overseas Students (ESOS) Act. Protection for international students under the ESOS framework. Tuition Protection Service (TPS) coverage. Verify SISTC's CRICOS registration at cricos.education.gov.au."
  },
  {
    "id": "contact-main",
    "title": "Contact SISTC",
    "category": "contact",
    "text": "Contact SISTC: Phone: +61 (2) 9061 5900. Website: https://sistc.edu.au/. Student Portal: sistc.meshedhe.com.au. Office Hours: Monday to Friday, 9:00 AM - 5:00 PM (AEST/AEDT). For course information and applications, contact the Admissions team. For current student enquiries, contact Student Services. For international student enquiries, contact the International Office. Visit us at any of our campuses in Sydney CBD, Parramatta, or Melbourne."
  },
  {
    "id": "contact-admissions",
    "title": "Admissions Contact",
    "category": "contact",
    "text": "SISTC Admissions: For prospective students and application enquiries. Phone: +61 (2) 9061 5900. Apply online: sistc.edu.au. Course information: sistc.meshedhe.com.au/Publics/PublicsPages/CourseInfo.aspx. The Admissions team can help with: Course selection and advice. Entry requirements. Application status. Credit for prior learning enquiries. Scholarship information. Respond times: Usually within 2-3 business days."
  },
  {
    "id": "contact-international",
    "title": "International Office Contact",
    "category": "contact",
    "text": "SISTC International Office: Support for international students and prospective international applicants. Phone: +61 (2) 9061 5900. Find an agent: sistc.meshedhe.com.au/Publics/PublicsPages/AgentListByCountry.aspx. The International Office can assist with: Application and admission. Visa guidance. OSHC information. Accommodation support. Pre-departure preparation. On-campus support. Agent coordination. International students are welcome to contact us with any questions about studying at SISTC."
  },
  {
    "id": "faq-duration",
    "title": "FAQ: How long are the courses?",
    "category": "faq",
    "text": "FAQ - Course Duration: Bachelor of Information Technology: 3 years full-time (6 trimesters), or part-time equivalent. Master of Information Technology: 2 years full-time (4 trimesters), or part-time equivalent. Duration may be reduced with Credit for Prior Learning. Exit qualifications: Diploma after Year 1 of Bachelor, Graduate Certificate after Semester 1 of Master, Graduate Diploma after Semester 2 of Master."
  },
  {
    "id": "faq-start",
    "title": "FAQ: When can I start?",
    "category": "faq",
    "text": "FAQ - When Can I Start: SISTC has three intakes per year. Trimester 1: Start February/March. Trimester 2: Start June. Trimester 3: Start September/October. Apply early to secure your place. International students should apply at least 8-12 weeks before intake to allow visa processing time. Check sistc.edu.au for specific dates and deadlines."
  },
  {
    "id": "faq-work",
    "title": "FAQ: Can I work while studying?",
    "category": "faq",
    "text": "FAQ - Working While Studying: International students on Student visa (subclass 500): Can work up to 48 hours per fortnight during study periods. Can work unlimited hours during scheduled course breaks. Must not start work until course has commenced. Domestic students: No work restrictions. Working can help with living expenses and provide valuable experience. SISTC Career Services can help with job search. Balance work and study carefully to maintain academic progress."
  },
  {
    "id": "faq-background",
    "title": "FAQ: Do I need an IT background?",
    "category": "faq",
    "text": "FAQ - IT Background Requirements: Bachelor of Information Technology: No IT background required. The program starts from fundamentals and builds knowledge progressively. Students from any educational background welcome. Master of Information Technology: No IT background required. The program accepts graduates from any discipline. Students without IT background may take bridging/foundation units. The MIT is designed for career changers wanting to enter the IT industry."
  },
  {
    "id": "faq-online",
    "title": "FAQ: Is online study available?",
    "category": "faq",
    "text": "FAQ - Online Study: SISTC primarily offers face-to-face instruction at our campuses. Benefits of on-campus study: Direct interaction with lecturers. Collaboration with classmates. Access to campus facilities. Networking opportunities. International students on student visas must study on-campus as per visa conditions. Online resources and learning materials supplement face-to-face classes through our Learning Management System."
  },
  {
    "id": "faq-accommodation",
    "title": "FAQ: Where can I live?",
    "category": "faq",
    "text": "FAQ - Accommodation: SISTC does not have on-campus accommodation, but we can help you find suitable housing. Options include: Homestay with Australian families ($250-350/week including meals). Purpose-built student accommodation ($300-450/week). Private rental apartments or shared houses ($200-400/week). Start looking for accommodation 4-8 weeks before arrival. Contact Student Services for accommodation provider recommendations and guidance."
  },
  {
    "id": "faq-fees",
    "title": "FAQ: How much does it cost?",
    "category": "faq",
    "text": "FAQ - Course Fees: Tuition fees vary by program and are published on sistc.edu.au. Additional costs: Student Services and Amenities Fee (SSAF). OSHC for international students (approx. $500-700/year). Textbooks and materials. Living expenses (estimate $21,000-25,000/year). Domestic students may be eligible for FEE-HELP loans. Payment plans may be available. Contact Admissions for current fee information: +61 (2) 9061 5900."
  },
  {
    "id": "statistics-students",
    "title": "SISTC Student Statistics",
    "category": "statistics",
    "text": "SISTC Student Statistics: 500+ students across Sydney and Melbourne campuses. Students from 40+ countries. Small class sizes for personalized learning. High student satisfaction rates. Growing alumni network in IT industry. Student diversity brings rich perspectives to classroom discussions and group work."
  },
  {
    "id": "statistics-outcomes",
    "title": "SISTC Student Satisfaction and Outcomes",
    "category": "statistics",
    "text": "SISTC Student Experience Survey Results: Teaching Practices: 85.1% positive rating (National average: 79.8%). Support Services: 85.4% positive rating (National average: 72.7%). Skill Development: 82.4% positive rating (National average: 79.8%). Based on Undergraduate Student Experience Survey 2021-2022. SISTC performs above national average across key indicators, demonstrating our commitment to quality education and student support."
  },
  {
    "id": "data-analytics-detail",
    "title": "Data Analytics Specialisation - Details",
    "category": "courses",
    "text": "Master of IT - Data Analytics Specialisation: Comprehensive training in extracting insights from data. Core topics: Statistical analysis and modeling. Machine learning and AI fundamentals. Data visualization techniques. Big data technologies (Hadoop, Spark). Business intelligence and reporting. Data mining and pattern recognition. Python and R programming for data science. Database management and SQL. Tools: Python, R, Tableau, Power BI, SQL, cloud platforms. Career paths: Data Analyst, Data Scientist, Business Intelligence Developer, Machine Learning Engineer, Analytics Consultant."
  },
  {
    "id": "cyber-security-detail",
    "title": "Cyber Security Specialisation - Details",
    "category": "courses",
    "text": "Master of IT - Cyber Security Specialisation: Comprehensive training in protecting information systems. Core topics: Network security fundamentals. Ethical hacking and penetration testing. Security governance and compliance. Risk assessment and management. Incident response and forensics. Cryptography fundamentals. Cloud security. Security operations. Tools: Kali Linux, Wireshark, Metasploit, SIEM tools, vulnerability scanners. Career paths: Security Analyst, Penetration Tester, Security Consultant, SOC Analyst, Security Engineer, CISO pathway."
  },
  {
    "id": "digital-leadership-detail",
    "title": "Digital Leadership Specialisation - Details",
    "category": "courses",
    "text": "Master of IT - Digital Leadership Specialisation: Preparing future IT leaders and technology executives. Core topics: IT strategy and governance. Digital transformation management. Project and program management. Change management. IT service management (ITIL). Enterprise architecture. Innovation management. Leadership and team management. Stakeholder engagement. Career paths: IT Manager, Project Manager, Digital Transformation Lead, CIO/CTO pathway, IT Consultant, Enterprise Architect."
  }
]
